tutorials/fluidSolidInteraction-preCICE/beamInCrossFlow/fluid-openfoam/system/preciceDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      preciceDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

preciceConfig "../precice-config.xml";

participant Fluid;

modules (FSI);

interfaces
{
    Interface1
    {
        mesh              Fluid-Mesh;
        patches           (interface);
        locations         faceCenters;
    
        readData
        (
            Displacement
        );
    
        writeData
        (
            Force
        );
    };
};

FSI
{
    // preCICE needs to be told the density in order to scale the forces
    // correctly when mapping to the solid
    solverType incompressible;
    rho rho [1 -3 0 0 0 0 0] 1000;
    nu  nu [ 0 2 -1 0 0 0 0 ] 1e-03;
}
